import { PropsInputs } from "../types";

export const HeaderNav = [
  { title: "services", url: "/servises" },
  { title: "project", url: "/project" },
  { title: "team", url: "/team" },
  { title: "ua", url: "/ua" },
];

export const perevagu = [
  {
    img: "/perevaga1.svg",
    title:
      "Мої сайти – це не просто гарна картинка, а повноцінний канал продажів, який постійно приводить нових клієнтів",
  },
  {
    img: "/perevaga2.svg",
    title:
      "Я не використовую конструктори (Redymag, Webflow, etc.), тому що створюю тільки якісні сайти",
  },
  {
    img: "/perevaga3.svg",
    title:
      "Разом із сайтом ви отримуєте готовий фундамент для просування в інтернеті завдяки SEO та аналітиці",
  },
  {
    img: "/perevaga4.svg",
    title:
      "Ви замовляєте цілісний продукт, адже я беру на себе всі етапи роботи – від аналізу вашого бізнесу до запуску готового сайту",
  },
  {
    img: "/perevaga5.svg",
    title:
      "Співпраця зі мною – це не лише стандартна розробка, а й обговорення десятків нових ідей для розвитку вашого бізнесу",
  },
  {
    img: "/perevaga6.svg",
    title:
      "Для мене не буває колишніх клієнтів, тому, одного разу замовивши у мене сайт, ви назавжди отримуєте мою підтримку",
  },
];

export const poslugi = [
  {
    title: "Landing Page",
    descriptions: [
      {
        title:
          "Ідеальний варіант для бізнесу, якому потрібна коротка, але змістовна, презентація",
        subtitle:
          "Завдяки зручності такого формату, можна легко подати користувачу всю важливу інформацію та швидко підвести його до покупки",
        proprety: "Обирайте цей тип сайту, якщо:",
        listOfPropositions: [
          {
            imageURL: "/lp1.svg",
            text: "Ви хочете презентувати власний інфо-продукт, послугу, книгу і т.д.",
          },
          {
            imageURL: "/lp2.svg",
            text: "У вас невелика кількість продуктів (до 8)",
          },
          {
            imageURL: "/lp3.svg",
            text: "Вам потрібне коротке портфоліо спеціаліста або сайт-візитка",
          },
        ],
      },
    ],
  },
  {
    title: "Багатосторінковий сайт",
    descriptions: [
      {
        title: "Величезне поле для креативу",
        subtitle:
          "Ви можете використати будь-яку кількість сторінок для того, щоб розповісти про свій бізнес, показати свій продукт, презентувати компанію або просто поділитись корисною інформацією",
        proprety: "Обирайте цей тип сайту, якщо:",
        listOfPropositions: [
          {
            imageURL: "/many1.svg",
            text: "Вам потрібно більше однієї сторінки на сайті",
          },
          {
            imageURL: "/many2.svg",
            text: "Ви плануєте зробити блог та/або особистий кабінет",
          },
          {
            imageURL: "/many3.svg",
            text: "На сайті передбачається будь-який інший додатковий функціонал",
          },
        ],
      },
    ],
  },
  {
    title: "Інтернет магазин",
    descriptions: [
      {
        title: "Зручний сайт для бізнесу, який дозволить користувачам:",
        subtitle:
          "Каталог, зручна фільтрація, особистий кабінет і продуманий до деталей інтерфейс точно збільшать кількість ваших клієнтів завдяки комфортному користуванню та легкому оформленню покупки",
        proprety: "Обирайте цей тип сайту, якщо:",
        listOfPropositions: [
          {
            imageURL: "/internetshop1.svg",
            text: "Швидко знайти потрібний товар",
          },
          {
            imageURL: "/internetshop2.svg",
            text: "Зробити замовлення у будь-який час",
          },
          {
            imageURL: "/internetshop3.svg",
            text: "У вас більше 8 товарів",
          },
          {
            imageURL: "/internetshop4.svg",
            text: "Вам потрібен каталог, корзина, особистий кабінет або інші сторінки такого типу",
          },
        ],
      },
    ],
  },
  {
    title: "Аудит сайту",
    descriptions: [
      {
        title: "Детальний аудит вашого сайту по всім можливим параметрам",
        subtitle:
          "В аудиті розглядаються: дизайн, текст, конверсія, технічні данні, індексація пошуковими системами та багато інших характеристик",
        proprety: "Аудит допоможе вам:",
        listOfPropositions: [
          {
            imageURL: "/audit1.svg",
            text: "Побачити зроблені помилки",
          },
          {
            imageURL: "/audit2.svg",
            text: "Знайти правильний підхід до своїх клієнтів",
          },
          {
            imageURL: "/audit3.svg",
            text: "В рази збільшити показник конверсії",
          },
          {
            imageURL: "/audit4.svg",
            text: "Отримати десятки нових ідей для сайту та багато чого іншого.",
          },
        ],
      },
    ],
  },
  {
    title: "Консультація",
    descriptions: [
      {
        title: "Ідеальний початок для просування вашого бізнесу в інтернеті",
        subtitle:
          "Окрім готового фундаменту для власного сайту, ви отримаєте рекомендації, які допоможуть вам швидко досягнути успіху в просуванні свого бізнесу",
        proprety: "",
        listOfPropositions: [
          {
            imageURL: "/consultation1.svg",
            text: "Консультація триває 1.5 години в онлайн форматі",
          },
          {
            imageURL: "/consultation2.svg",
            text: "Ви можете вказати додаткові запитання щодо вашого бізнесу та, за попереднім узгодженням, я включу їх в нашу консультацію",
          },
        ],
      },
    ],
  },
];

export const faqArray = [
  {
    question: "Чи потрібно підписувати контракт перед роботою?",
    answer:
      "Так, після обговорення плану роботи ми разом підписуємо контракт за допомогою цифрового підпису. Контракт регулює весь процес роботи, виплати, будь-які непередбачувані обставини та інші важливі частини проєкту. Даний документ захищає обидві сторони – як замовника, так і виконавця.",
  },
  {
    question: "Як проводиться оплата?",
    answer:
      "Є два варіанти оплати: повна передплата та поетапна передплата. Повна передплата передбачає переказ всієї суми за проєкт одразу на початку співпраці. Поетапна передплата передбачає оплату частинами за кожен етап (або декілька). До кожної платіжної операції прикріплюється інвойс (чек) з інформацією про оплачену послугу або етап.",
  },
  {
    question: "Чи можна повернути кошти після оплати?",
    answer:
      "Так, можна. Як це працює: в будь-якому випадку з суми повернення утримується 5% та комісія банку. Повертаються кошти лише за ті етапи проєкту, які не були розпочаті. Вся робота, яка була виконана та оплачена, надсилається замовнику. Етапи, які були розпочаті, завжди доводяться до кінця (за бажанням замовника).",
  },
  {
    question: "Чи можна допрацювати вже наявний сайт?",
    answer:
      "Ні, лише створити сайт з нуля. Наявний сайт можна використати як приклад для дизайну, контенту та інш., проте це не передбачає зменшення вартості послуги.",
  },
];

export const inputs: PropsInputs[] = [
  {
    style: "mb-5 pl-4 mt-10 border-[2px] rounded-3xl h-[40px]",
    type: "text",
    placeholder: "Введіть ваше Ім'я",
  },
  {
    style: "mb-5 pl-4  border-[2px] rounded-3xl h-[40px]",
    type: "text",
    placeholder: "Введіть вашe Прізвище",
  },
  {
    style: "mb-5 pl-4  border-[2px] rounded-3xl h-[40px]",
    type: "email",
    placeholder: "Введіть вашу почтову скриньку",
  },
];

export const inputsWhyUs: PropsInputs[] = [
  {
    style: "mb-5 pl-4 mt-10 border-[2px] rounded-3xl h-[40px]",
    type: "text",
    placeholder: "Введіть ваше Ім'я",
  },
  {
    style: "mb-5 pl-4  border-[2px] rounded-3xl h-[40px]",
    type: "text",
    placeholder: "Введіть вашe Прізвище",
  },
  {
    style: "mb-5 pl-4 pb-[60px]  border-[2px] rounded-3xl h-[100px] w-[100%]",
    type: "text",
    placeholder: "Повідомлення",
  },
];

export const socialNet = [
  {
    title: "Facebook",
    url: "https://www.facebook.com/people/VNV-Solutions/100088433736254/",
  },
  {
    title: "Instagram",
    url: "https://www.instagram.com/vnv_solutions/?igshid=MWI4MTIyMDE%3D",
  },
  {
    title: "Telegram",
    url: "https://t.me/vnv_solutions",
  },
  {
    title: "Linkedin",
    url: "https://www.linkedin.com/company/vnv-tech/",
  },
  {
    title: "TikTok",
    url: "https://www.tiktok.com/@vnvsolutions?_t=8YVB28bloQP&_r=1",
  },
];

export const testimonials = [
  {
    id: 1,
    name: "Іван Петрович",
    text: "Ваша компанія надзвичайно професійна. Дуже задоволений вашими послугами.",
  },
  {
    id: 2,
    name: "Марія Коваленко",
    text: "Ваш продукт дійсно допоміг мені вирішити багато проблем. Дякую!",
  },
  {
    id: 3,
    name: "Петро Сидоренко",
    text: "Найкраща компанія, з якою я співпрацював. Рекомендую всім!",
  },
];
